Repository: Wujuhu/Codexio
Catalog: macos/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# 已关闭
source: Off
zh_hans: 已关闭

# 已关闭 · 当前路由直连
source: Off · Direct connection
zh_hans: 已关闭 · 当前路由直连

# 已到期
source: Expired
zh_hans: 已到期

# 已加载上次缓存
source: Previous cache loaded
zh_hans: 已加载上次缓存

# 已加载字体 %s / %s
source: Loaded font %s / %s
zh_hans: 已加载字体 %s / %s

# 已取消更新
source: Update cancelled
zh_hans: 已取消更新

# 已取消自动更新
source: Automatic update cancelled
zh_hans: 已取消自动更新

# 已取消读取
source: Read cancelled
zh_hans: 已取消读取

# 已同步
source: Synced
zh_hans: 已同步

# 已完成
source: Completed
zh_hans: 已完成

# 已完成原生界面与本机统计调整，保留每条调用的模型、速度、推理强度和费用明细。
source: Native UI and local statistics are updated, with model, speed, reasoning and cost details retained for every call.
zh_hans: 已完成原生界面与本机统计调整，保留每条调用的模型、速度、推理强度和费用明细。

# 已定价
source: Priced
zh_hans: 已定价

# 已应用设置 · 等待选择重启方式
source: Settings applied · Choose when to restart
zh_hans: 已应用设置 · 等待选择重启方式

# 已开启
source: On
zh_hans: 已开启

# 已恢复遗留配置；请重新开启上游检测以重启客户端
source: Legacy configuration restored. Enable upstream detection again to restart the client.
zh_hans: 已恢复遗留配置；请重新开启上游检测以重启客户端

# 已恢复配置 · 等待选择重启方式
source: Configuration restored · Choose when to restart
zh_hans: 已恢复配置 · 等待选择重启方式

# 已折算
source: Calculated
zh_hans: 已折算

# 已收到额度更新
source: Allowance update received
zh_hans: 已收到额度更新

# 已整理页面结构和本机统计。
source: Page structure and local statistics are ready.
zh_hans: 已整理页面结构和本机统计。

# 已是最新版本
source: Up to date
zh_hans: 已是最新版本

# 已是最新版本。
source: Up to date.
zh_hans: 已是最新版本。

# 已更新
source: Updated
zh_hans: 已更新

# 已更新请求日志，加入每次请求的 Token、价格与 Fast 状态。会话预览分别显示用户消息和模型输出，保留必要上下文，长文本在第三行末尾省略。
source: Request logs now include tokens, cost and Fast status. Chat previews show user messages and model output separately, retaining relevant context and truncating long text after three lines.
zh_hans: 已更新请求日志，加入每次请求的 Token、价格与 Fast 状态。会话预览分别显示用户消息和模型输出，保留必要上下文，长文本在第三行末尾省略。

# 已用
source: Used
zh_hans: 已用

# 已用 Credits
source: Credits used
zh_hans: 已用 Credits

# 已用额度
source: Credits used
zh_hans: 已用额度

# 已索引
source: Indexed
zh_hans: 已索引

# 已索引 %s 个日志文件
source: Indexed %s log files
zh_hans: 已索引 %s 个日志文件

# 已选择
source: Selected
zh_hans: 已选择

# 平台更新清单格式无效
source: Invalid platform update manifest
zh_hans: 平台更新清单格式无效

# 应用
source: App
zh_hans: 应用

# 应用信息无效
source: Invalid application information
zh_hans: 应用信息无效

# 应用副本不完整
source: The app copy is incomplete
zh_hans: 应用副本不完整

# 应用图标
source: App icon
zh_hans: 应用图标

# 应用或小组件标识无效
source: Invalid app or widget identity
zh_hans: 应用或小组件标识无效

# 应用更新
source: App updates
zh_hans: 应用更新

# 应用版本不匹配
source: The app version does not match
zh_hans: 应用版本不匹配

# 应用目录
source: Apply directory
zh_hans: 应用目录

# 应用程序目录中的同名 App 不属于 Codexio
source: The existing app at this path is not Codexio
zh_hans: 应用程序目录中的同名 App 不属于 Codexio

# 应用签名校验失败
source: App signature verification failed
zh_hans: 应用签名校验失败

# 应用路径
source: Apply path
zh_hans: 应用路径

# 应用路径不能是符号链接
source: The app path cannot be a symbolic link
zh_hans: 应用路径不能是符号链接

# 底层模式
source: Desktop layer
zh_hans: 底层模式

# 底部
source: Bottom
zh_hans: 底部

# 开启
source: Enable
zh_hans: 开启

# 开启上游检测？
source: Enable upstream detection?
zh_hans: 开启上游检测？

# 开启：Fast；关闭：Standard；混合：本轮包含不同档位；未知：日志未记录。
source: On: Fast; off: Standard; mixed: multiple tiers in one turn; unknown: not recorded.
zh_hans: 开启：Fast；关闭：Standard；混合：本轮包含不同档位；未知：日志未记录。

# 开始扫描
source: Rescan now
zh_hans: 开始扫描

# 当前任务 Token
source: Current task tokens
zh_hans: 当前任务 Token

# 当前任务状态
source: Current task status
zh_hans: 当前任务状态

# 当前任务费用
source: Current task cost
zh_hans: 当前任务费用

# 当前内置模型供应商没有可安全接管的 Responses base_url
source: This built-in provider has no Responses base_url that can be safely managed
zh_hans: 当前内置模型供应商没有可安全接管的 Responses base_url

# 当前周额度 · 本机可用聊天
source: Current weekly allowance · local chats
zh_hans: 当前周额度 · 本机可用聊天

# 当前时间范围 暂无请求记录
source: No requests in this time range
zh_hans: 当前时间范围 暂无请求记录

# 当前模型供应商已指向本机路由，未重复接管
source: The current provider already uses the local relay
zh_hans: 当前模型供应商已指向本机路由，未重复接管

# 当前模型供应商未在 model_providers 中定义
source: The current provider is not defined in model_providers
zh_hans: 当前模型供应商未在 model_providers 中定义

# 当前模型供应商没有可接管的 base_url
source: The current provider has no base_url to manage
zh_hans: 当前模型供应商没有可接管的 base_url

# 当前模型供应商的 base_url 字段无效
source: The provider base_url field is invalid
zh_hans: 当前模型供应商的 base_url 字段无效

# 当前模型供应商的 base_url 无效
source: The provider base_url is invalid
zh_hans: 当前模型供应商的 base_url 无效

# 当前模型供应商的 requires_openai_auth 无效
source: The provider requires_openai_auth field is invalid
zh_hans: 当前模型供应商的 requires_openai_auth 无效

# 当前模型服务的 base_url 无效
source: The model service base_url is invalid
zh_hans: 当前模型服务的 base_url 无效

# 当前模型服务的 base_url 端口无效
source: The model service base_url port is invalid
zh_hans: 当前模型服务的 base_url 端口无效

# 当前没有可重置的额度窗口
source: No rate-limit window needs a reset
zh_hans: 当前没有可重置的额度窗口

# 当前版本
source: Current version
zh_hans: 当前版本

# 当前账号观测起点：
source: Account observations started:
zh_hans: 当前账号观测起点：

# 当前账户尚未提供周期明细
source: This account has not provided period details
zh_hans: 当前账户尚未提供周期明细

# 当前账户尚未提供这项明细
source: This account has not provided these details
zh_hans: 当前账户尚未提供这项明细

# 当前连续天数
source: Current streak
zh_hans: 当前连续天数

# 当前配置方案不存在或无法读取
source: The selected profile does not exist or cannot be read
zh_hans: 当前配置方案不存在或无法读取

# 当前配置键不能安全接管
source: The configuration key cannot be safely managed
zh_hans: 当前配置键不能安全接管

# 当前额度
source: Current allowance
zh_hans: 当前额度

# 待确认账号
source: Account unconfirmed
zh_hans: 待确认账号

# 待计量
source: Awaiting metering
zh_hans: 待计量

# 待连接
source: Waiting for connection
zh_hans: 待连接

# 待采样
source: Waiting for samples
zh_hans: 待采样

# 快速模式
source: Fast mode
zh_hans: 快速模式

# 忽略无法解析的额度通知
source: Ignoring an unparseable allowance notification
zh_hans: 忽略无法解析的额度通知

# 思考强度
source: Reasoning effort
zh_hans: 思考强度

# 总 Token
source: Total tokens
zh_hans: 总 Token

# 总耗时 %.3f 秒。
source: Total duration %.3f seconds.
zh_hans: 总耗时 %.3f 秒。

# 恢复自动基础价
source: Restore automatic price
zh_hans: 恢复自动基础价

# 恢复默认
source: Reset to default
zh_hans: 恢复默认

# 恢复默认字段
source: Reset columns
zh_hans: 恢复默认字段

# 悬浮窗
source: Floating window
zh_hans: 悬浮窗

# 悬浮窗样式
source: Floating window style
zh_hans: 悬浮窗样式

# 悬浮窗样式预览
source: Floating window preview
zh_hans: 悬浮窗样式预览

# 截止时间
source: Expires
zh_hans: 截止时间

# 截止时间未提供
source: Expiry not provided
zh_hans: 截止时间未提供

# 所属用户请求
source: Parent user request
zh_hans: 所属用户请求

# 手工 Standard 基础价
source: Manual Standard base price
zh_hans: 手工 Standard 基础价

# 打开 Codexio 主程序
source: Open Codexio
zh_hans: 打开 Codexio 主程序

# 打开 Codexio 查看最近请求
source: Open Codexio to view recent requests
zh_hans: 打开 Codexio 查看最近请求

# 打开主界面
source: Open main window
zh_hans: 打开主界面

# 打开主界面 ↗
source: Open main window ↗
zh_hans: 打开主界面 ↗

# 打开数据目录
source: Open data folder
zh_hans: 打开数据目录

# 打开聊天 ↗
source: Open chat ↗
zh_hans: 打开聊天 ↗

# 托盘模式
source: Tray mode
zh_hans: 托盘模式

# 扫描中
source: Scanning
zh_hans: 扫描中

# 找不到可安全修改的用户配置层
source: No writable user configuration layer was found
zh_hans: 找不到可安全修改的用户配置层

# 拖动可沿边缘移动或拖出停靠
source: Drag along the edge or away to undock
zh_hans: 拖动可沿边缘移动或拖出停靠

# 拖动调整导航栏宽度
source: Drag to resize the sidebar
zh_hans: 拖动调整导航栏宽度

# 拖动调整请求预览宽度
source: Drag to resize the request preview
zh_hans: 拖动调整请求预览宽度

# 按主请求发起时间统计；关联子代理不重复计入。
source: Counted by the main request start time; related subagents are not counted again.
zh_hans: 按主请求发起时间统计；关联子代理不重复计入。

# 按主请求发起时间统计；关联子代理不重复计入，未归属调用不计为用户请求。
source: Counted by the main request start time; related subagents are not counted again, and unassigned calls are not user requests.
zh_hans: 按主请求发起时间统计；关联子代理不重复计入，未归属调用不计为用户请求。

# 按各轮实际处理时间合计，不包含等待用户答复的间隔；并行子代理不重复相加。
source: Total active time across turns, excluding idle time waiting for user replies; parallel subagents are not added twice.
zh_hans: 按各轮实际处理时间合计，不包含等待用户答复的间隔；并行子代理不重复相加。

# 按同一账号、套餐与额度周期内本机调用费用和额度变化估算；总 Token 仅用于展示。
source: Estimated from local call costs and allowance changes within the same account, plan and cycle; tokens are shown separately.
zh_hans: 按同一账号、套餐与额度周期内本机调用费用和额度变化估算；总 Token 仅用于展示。

# 按已确认数据计算
source: Based on confirmed data
zh_hans: 按已确认数据计算

# 按已记录用量折算整周额度，金额供参考。
source: Estimated full-week allowance from recorded usage; amount is a reference.
zh_hans: 按已记录用量折算整周额度，金额供参考。

# 按本机 Codex 提供的模型筛选
source: Filter models available in local Codex
zh_hans: 按本机 Codex 提供的模型筛选

# 按本机已计价调用与同期周额度变化估算。
source: Estimated from priced local calls and corresponding weekly allowance changes.
zh_hans: 按本机已计价调用与同期周额度变化估算。

# 按模型
source: By model
zh_hans: 按模型

# 按模型调用
source: Model calls
zh_hans: 按模型调用

# 按用户请求
source: User requests
zh_hans: 按用户请求

# 接口尚未提供逐次截止时间。
source: Individual expiry dates are not available from the service.
zh_hans: 接口尚未提供逐次截止时间。

# 推理强度
source: Reasoning
zh_hans: 推理强度

# 推理强度未知
source: Unknown reasoning
zh_hans: 推理强度未知

# 推理强度未知 %d 次
source: Unknown reasoning in %d calls
zh_hans: 推理强度未知 %d 次

# 推理输出
source: Reasoning output
zh_hans: 推理输出

# 搜索日志
source: Search logs
zh_hans: 搜索日志

# 搜索模型
source: Search models
zh_hans: 搜索模型

# 搜索模型…
source: Search models…
zh_hans: 搜索模型…

# 搜索输入、会话或 ID
source: Search prompt, chat or ID
zh_hans: 搜索输入、会话或 ID

# 搜索输入、聊天或 ID
source: Search prompt, chat or ID
zh_hans: 搜索输入、聊天或 ID

# 撤销
source: Undo
zh_hans: 撤销

# 操作
source: Action
zh_hans: 操作

# 操作失败，已保留现有数据
source: The operation failed; existing data is retained
zh_hans: 操作失败，已保留现有数据

# 操作未完成，请重试
source: The operation did not complete. Try again.
zh_hans: 操作未完成，请重试

# 操作超时
source: Operation timed out
zh_hans: 操作超时

# 收起导航栏
source: Collapse sidebar
zh_hans: 收起导航栏

# 数据
source: Data
zh_hans: 数据

# 数据待核对
source: Data needs verification
zh_hans: 数据待核对

# 数据来源
source: Data
zh_hans: 数据来源

# 数据源
source: Data
zh_hans: 数据源

# 数据目录
source: Data folder
zh_hans: 数据目录

# 数据过期
source: Out of date
zh_hans: 数据过期

# 整周估值依据本机消费与账户额度变化，仅供参考
source: Full-week estimates compare local cost with account allowance changes
zh_hans: 整周估值依据本机消费与账户额度变化，仅供参考

# 整周额度估值
source: Full-week allowance estimate
zh_hans: 整周额度估值

# 整理原生应用设计
source: Refine the native app design
zh_hans: 整理原生应用设计

# 整理菜单栏和小组件设计
source: Refine the menu bar and widgets
zh_hans: 整理菜单栏和小组件设计

# 整轮累计
source: Whole-turn total
zh_hans: 整轮累计

# 整轮耗时
source: Whole-turn duration
zh_hans: 整轮耗时

# 整轮耗时包含工具等待和其他停顿，表示整轮平均输出速度。
source: Turn duration includes tool waits and other pauses; this is the average output speed for the whole turn.
zh_hans: 整轮耗时包含工具等待和其他停顿，表示整轮平均输出速度。

# 新版安装包信息与此 Mac 不匹配
source: The update package does not match this Mac
zh_hans: 新版安装包信息与此 Mac 不匹配

# 新版尚未上传完整的
source: The release is missing a complete
zh_hans: 新版尚未上传完整的

# 新版尚未提供适合此 Mac 芯片的安装包
source: No update package is available for this Mac architecture
zh_hans: 新版尚未提供适合此 Mac 芯片的安装包

# 新版已就绪，即将自动重启…
source: The update is ready. Restarting…
zh_hans: 新版已就绪，即将自动重启…

# 新版未能确认启动，保留旧版以便恢复
source: The new app did not confirm startup; the previous app is retained
zh_hans: 新版未能确认启动，保留旧版以便恢复

# 无
source: None
zh_hans: 无

# 无到期限制
source: No expiry
zh_hans: 无到期限制

# 无法保存价格版本:
source: Could not save the price version:
zh_hans: 无法保存价格版本:

# 无法保存客户端配置基线，本次会话继续使用内存记录
source: Could not save the client configuration baseline; this session will use its in-memory record
zh_hans: 无法保存客户端配置基线，本次会话继续使用内存记录

# 无法启动本地转发，已恢复原路由
source: Could not start the local relay; the original route was restored
zh_hans: 无法启动本地转发，已恢复原路由

# 无法在本机定位此聊天
source: This chat cannot be opened locally
zh_hans: 无法在本机定位此聊天

# 无法复制应用
source: Cannot copy the app
zh_hans: 无法复制应用

# 无法打开用量数据库
source: Cannot open the usage database
zh_hans: 无法打开用量数据库

# 无法确认 Codex 认证状态，未修改路由
source: Codex authentication could not be verified; no route was changed
zh_hans: 无法确认 Codex 认证状态，未修改路由

# 无法确认当前桌面客户端的配置路径，请等待客户端启动完成后再开启上游检测
source: The desktop configuration path is unconfirmed. Wait for the client to finish starting before enabling upstream detection.
zh_hans: 无法确认当前桌面客户端的配置路径，请等待客户端启动完成后再开启上游检测

# 无法确认当前账户
source: Cannot identify the current account
zh_hans: 无法确认当前账户

# 无法确认配置是否已生效
source: Could not verify whether the configuration is active
zh_hans: 无法确认配置是否已生效

# 无法读取 Codex 配置
source: Cannot read Codex configuration
zh_hans: 无法读取 Codex 配置

# 无法读取 Codex 配置，未更改当前路由
source: Cannot read Codex configuration; the current route was retained
zh_hans: 无法读取 Codex 配置，未更改当前路由

# 无法读取图标
source: The icon could not be loaded
zh_hans: 无法读取图标

# 无法连接 ChatGPT（网络或代理异常）
source: Cannot connect to ChatGPT (network or proxy error)
zh_hans: 无法连接 ChatGPT（网络或代理异常）

# 无法连接 GitHub，请检查网络后重试
source: Cannot connect to GitHub. Check the network and try again.
zh_hans: 无法连接 GitHub，请检查网络后重试

# 日志
source: Logs
zh_hans: 日志

# 日志刷新
source: Log refresh
zh_hans: 日志刷新

# 日志扫描失败
source: Log scan failed
zh_hans: 日志扫描失败

# 日志数据
source: Log data
zh_hans: 日志数据

# 日志未记录这次模型调用的独立耗时。
source: No explicit duration was recorded for this model call.
zh_hans: 日志未记录这次模型调用的独立耗时。

# 旧版 Codexio 进程未能退出
source: An old Codexio process could not stop
zh_hans: 旧版 Codexio 进程未能退出

# 旧版小组件后台服务未能退出
source: The legacy widget service could not stop
zh_hans: 旧版小组件后台服务未能退出

# 旧版正在退出，请完成其退出提示后重试
source: Finish quitting the previous app before retrying installation
zh_hans: 旧版正在退出，请完成其退出提示后重试

# 旧路由需要先在原版 Codexio 中关闭，恢复记录已保留
source: Disable the legacy route in the previous Codexio app first; recovery data is retained
zh_hans: 旧路由需要先在原版 Codexio 中关闭，恢复记录已保留

# 时长仅含已记录区间
source: Durations include recorded intervals only
zh_hans: 时长仅含已记录区间

# 时间
source: Time
zh_hans: 时间

# 时间未记录
source: Time not recorded
zh_hans: 时间未记录

# 时间：
source: Time:
zh_hans: 时间：

# 明天
source: Tomorrow
zh_hans: 明天

# 显示上次成功获取的额度
source: Showing the last successfully retrieved limits
zh_hans: 显示上次成功获取的额度

# 显示内容
source: Display content
zh_hans: 显示内容

# 显示字段
source: Columns
zh_hans: 显示字段

# 显示悬浮窗
source: Show floating window
zh_hans: 显示悬浮窗

# 显示更多
source: Show more
zh_hans: 显示更多

# 显示模式
source: Display mode
zh_hans: 显示模式

# 显示边框
source: Show border
zh_hans: 显示边框

# 普通输入
source: Uncached input
zh_hans: 普通输入

# 暂不可使用
source: Unavailable
zh_hans: 暂不可使用

# 暂不可用
source: Unavailable
zh_hans: 暂不可用

# 暂无
source: None yet
zh_hans: 暂无

# 暂无单模型数据
source: No single-model data
zh_hans: 暂无单模型数据

# 暂无可用重置次数。
source: No resets available.
zh_hans: 暂无可用重置次数。

# 暂无可识别的用户请求
source: No identifiable user requests
zh_hans: 暂无可识别的用户请求

# 暂无对比
source: No comparison available
zh_hans: 暂无对比

# 暂无有效数据
source: No confirmed data
zh_hans: 暂无有效数据

# 暂无本机聊天记录
source: No local chat records
zh_hans: 暂无本机聊天记录

# 暂无记录
source: No records
zh_hans: 暂无记录

# 暂无请求
source: No requests yet
zh_hans: 暂无请求

# 暂无重置次数与明细。
source: No reset count or details available.
zh_hans: 暂无重置次数与明细。

# 暂无额度数据
source: No allowance data
zh_hans: 暂无额度数据

# 暂未读取到本机 Codex 模型列表
source: Local Codex model list has not been read
zh_hans: 暂未读取到本机 Codex 模型列表

# 更改后自动保存并立即应用。
source: Changes are saved and applied automatically.
zh_hans: 更改后自动保存并立即应用。

# 更新下载必须使用 HTTPS
source: Update downloads require HTTPS
zh_hans: 更新下载必须使用 HTTPS

# 更新包芯片架构不匹配
source: Update architecture does not match
zh_hans: 更新包芯片架构不匹配

# 更新包解压失败
source: Could not extract the update
zh_hans: 更新包解压失败

# 更新失败，请稍后重试
source: Update failed. Try again later.
zh_hans: 更新失败，请稍后重试

# 更新已下载，可立即安装
source: Update downloaded and ready to install
zh_hans: 更新已下载，可立即安装

# 更新已就绪，正常退出后安装
source: Update ready; installs after quitting normally
zh_hans: 更新已就绪，正常退出后安装

# 更新文件不属于指定的 GitHub 发布版本
source: The update file does not belong to the expected GitHub release
zh_hans: 更新文件不属于指定的 GitHub 发布版本

# 更新文件不是有效 ZIP
source: The update is not a valid ZIP
zh_hans: 更新文件不是有效 ZIP

# 更新文件不是有效的 Windows 程序
source: The update is not a valid Windows executable
zh_hans: 更新文件不是有效的 Windows 程序

# 更新文件大小与发布信息不一致
source: Update size does not match release information
zh_hans: 更新文件大小与发布信息不一致

# 更新文件大小或 SHA-256 不匹配
source: Update size or SHA-256 does not match
zh_hans: 更新文件大小或 SHA-256 不匹配

# 更新文件大小无效
source: Invalid update file size
zh_hans: 更新文件大小无效

# 更新文件校验失败，已保留当前版本
source: Update verification failed; the current version is retained
zh_hans: 更新文件校验失败，已保留当前版本

# 更新时间
source: Updated
zh_hans: 更新时间

# 更新时间 —
source: Updated —
zh_hans: 更新时间 —

# 更新暂存已存在
source: An update staging bundle already exists
zh_hans: 更新暂存已存在

# 更新未完成：%s
source: Update did not complete: %s
zh_hans: 更新未完成：%s

# 更新清单必须通过 HTTPS 获取
source: Update manifests require HTTPS
zh_hans: 更新清单必须通过 HTTPS 获取

# 更新清单无效
source: Invalid update manifest
zh_hans: 更新清单无效

# 更新清单格式无效
source: Invalid update manifest
zh_hans: 更新清单格式无效

# 更新程序未就绪，当前应用继续运行
source: The installer is not ready; the current app will keep running
zh_hans: 更新程序未就绪，当前应用继续运行

# 更新附件缺少 SHA-256 校验值，请重新上传附件
source: The release asset has no SHA-256 digest. Upload it again.
zh_hans: 更新附件缺少 SHA-256 校验值，请重新上传附件

# 最常用的推理强度
source: Most used reasoning
zh_hans: 最常用的推理强度

# 最轻
source: Minimal
zh_hans: 最轻

# 最近 7 天
source: Last 7 days
zh_hans: 最近 7 天

# 最近更新
source: Last updated
zh_hans: 最近更新

# 最近更新 —
source: Last updated —
zh_hans: 最近更新 —

# 最近请求
source: Recent requests
zh_hans: 最近请求

# 最长聊天时长
source: Longest chat
zh_hans: 最长聊天时长

# 最长连续天数
source: Longest streak
zh_hans: 最长连续天数

# 最高
source: Max
zh_hans: 最高

# 有新版本
source: Update available
zh_hans: 有新版本

# 服务暂不可用
source: Service unavailable
zh_hans: 服务暂不可用

# 服务档位
source: Service tier
zh_hans: 服务档位

# 服务返回了无效统计数据
source: The service returned invalid statistics
zh_hans: 服务返回了无效统计数据

# 服务重定向被拒绝
source: Service redirect refused
zh_hans: 服务重定向被拒绝

# 未加载
source: Not loaded
zh_hans: 未加载

# 未填写
source: Not set
zh_hans: 未填写

# 未定价
source: Unpriced
zh_hans: 未定价

# 未定价调用
source: Unpriced calls
zh_hans: 未定价调用

# 未归属调用
source: Unassigned call
zh_hans: 未归属调用

# 未归类
source: Unattributed
zh_hans: 未归类

# 未找到 Codex 客户端，未修改路由
source: Codex was not found; no route was changed
zh_hans: 未找到 Codex 客户端，未修改路由

# 未找到 Codex，请安装 ChatGPT 或 Codex 并登录
source: Codex was not found. Install ChatGPT or Codex and sign in.
zh_hans: 未找到 Codex，请安装 ChatGPT 或 Codex 并登录

# 未找到 Codex，请确认已安装并登录
source: Codex was not found. Make sure it is installed and signed in.
zh_hans: 未找到 Codex，请确认已安装并登录

# 未找到内嵌字体，回退系统字体: %s
source: Bundled font was not found; using the system font: %s
zh_hans: 未找到内嵌字体，回退系统字体: %s

# 未登录 ChatGPT / Codex
source: Not signed in to ChatGPT / Codex
zh_hans: 未登录 ChatGPT / Codex

# 未知
source: Unknown
zh_hans: 未知

# 未知模型
source: Unknown model
zh_hans: 未知模型

# 未缓存输入
source: Uncached input
zh_hans: 未缓存输入

# 未能开始安装：
source: Could not start installation:
zh_hans: 未能开始安装：

# 未记录
source: Not recorded
zh_hans: 未记录

# 未记录会话标题
source: Chat title not recorded
zh_hans: 未记录会话标题

# 未记录本次请求的可见输出
source: Visible output was not recorded for this request
zh_hans: 未记录本次请求的可见输出

# 未记录用户输入
source: User input not recorded
zh_hans: 未记录用户输入

# 未记录该轮用户消息
source: User message not recorded for this turn
zh_hans: 未记录该轮用户消息

# 未读取到本机 Codex 可用模型列表
source: Could not read available local Codex models
zh_hans: 未读取到本机 Codex 可用模型列表

# 本周额度
source: This week’s allowance
zh_hans: 本周额度

# 本地代理尚未退出，请稍后重试
source: The local relay has not exited. Try again later.
zh_hans: 本地代理尚未退出，请稍后重试

# 本地周期与估值记录
source: Local cycle estimates
zh_hans: 本地周期与估值记录

# 本地扫描
source: Local scan
zh_hans: 本地扫描

# 本地索引
source: Local index
zh_hans: 本地索引

# 本地观测估值
source: Local observation estimate
zh_hans: 本地观测估值

# 本地计量扫描失败
source: Local metering scan failed
zh_hans: 本地计量扫描失败

# 本地转发启动超时，已恢复原路由
source: Local relay startup timed out; the original route was restored
zh_hans: 本地转发启动超时，已恢复原路由

# 本地转发服务尚未就绪
source: The local relay is not ready
zh_hans: 本地转发服务尚未就绪

# 本地转发服务拒绝操作，当前配置已保留
source: The local relay refused the operation; the current configuration is retained
zh_hans: 本地转发服务拒绝操作，当前配置已保留

# 本地转发服务连接失败，正在保留恢复记录
source: Cannot connect to the local relay; retaining recovery information
zh_hans: 本地转发服务连接失败，正在保留恢复记录

# 本期 %s — %s：%s 前期 %s — %s：%s
source: Current %s — %s: %s Previous %s — %s: %s
zh_hans: 本期 %s — %s：%s 前期 %s — %s：%s

# 本机
source: Local
zh_hans: 本机

# 本机 Codex
source: Local Codex
zh_hans: 本机 Codex

# 本机 Codex 模型列表暂无可显示模型
source: No local Codex models to display
zh_hans: 本机 Codex 模型列表暂无可显示模型

# 本机 Token
source: Local tokens
zh_hans: 本机 Token

# 本机 Token 排行
source: Local token ranking
zh_hans: 本机 Token 排行

# 本机日志目录
source: Local log directory
zh_hans: 本机日志目录

# 本机用量
source: Local usage
zh_hans: 本机用量

# 本机记录
source: Local records
zh_hans: 本机记录

# 本机记录 · 按模型调用次数统计模式占比
source: Local records · mode shares by model calls
zh_hans: 本机记录 · 按模型调用次数统计模式占比

# 本机记录 · 费用按模型价格估算
source: Local records · cost estimated from model prices
zh_hans: 本机记录 · 费用按模型价格估算

# 本机转发未能启动
source: The local relay could not start
zh_hans: 本机转发未能启动

# 本机（模拟）
source: Local (mock)
zh_hans: 本机（模拟）

# 本次未启用
source: Not enabled in this session
zh_hans: 本次未启用

# 本次调用
source: This call
zh_hans: 本次调用

# 条件
source: Condition
zh_hans: 条件

# 条形
source: Bars
zh_hans: 条形

# 条请求
source: requests
zh_hans: 条请求

# 来源
source: Source
zh_hans: 来源

# 极简
source: Minimal
zh_hans: 极简

# 极高
source: Extra high
zh_hans: 极高

# 查看
source: View
zh_hans: 查看

# 查看 Codex 剩余额度与重置时间
source: View Codex remaining allowance and reset times
zh_hans: 查看 Codex 剩余额度与重置时间

# 查看会话标题和该轮用户输入
source: View the chat title and this turn’s prompt
zh_hans: 查看会话标题和该轮用户输入

# 查看全部
source: View all
zh_hans: 查看全部

# 查看最近请求、费用与剩余额度
source: View recent requests, cost and remaining allowance
zh_hans: 查看最近请求、费用与剩余额度

# 查看额度排行
source: View allowance ranking
zh_hans: 查看额度排行

# 标准
source: Standard
zh_hans: 标准

# 标准 API 单价 × Codex 倍率
source: Standard API price × Codex multiplier
zh_hans: 标准 API 单价 × Codex 倍率

# 标准定价（美元 / 1M Token）
source: Standard prices (USD / 1M tokens)
zh_hans: 标准定价（美元 / 1M Token）

# 校验通过，正在准备安装…
source: Verified. Preparing installation…
zh_hans: 校验通过，正在准备安装…

# 样式
source: Style
zh_hans: 样式

# 桌面底层
source: Desktop layer
zh_hans: 桌面底层

# 档位
source: Tier
zh_hans: 档位

# 检查并更新
source: Check for updates
zh_hans: 检查并更新

# 检查更新
source: Check for updates
zh_hans: 检查更新

# 检测中
source: Detecting
zh_hans: 检测中

# 检测已暂停
source: Detection paused
zh_hans: 检测已暂停

# 概览
source: Overview
zh_hans: 概览

# 模型
source: Model
zh_hans: 模型

# 模型 ID
source: Model ID
zh_hans: 模型 ID

# 模型价格同步失败，沿用已缓存价格
source: Price sync failed; retaining cached prices
zh_hans: 模型价格同步失败，沿用已缓存价格

# 模型供应商
source: Model provider
zh_hans: 模型供应商

# 模型供应商未记录
source: Model provider was not recorded
zh_hans: 模型供应商未记录

# 模型供应商配置已变化，未进行接管
source: Provider configuration changed; no route was changed
zh_hans: 模型供应商配置已变化，未进行接管

# 模型供应商配置路径无效
source: Invalid provider configuration path
zh_hans: 模型供应商配置路径无效

# 模型占比
source: Model share
zh_hans: 模型占比

# 模型名称不能为空
source: Enter a model name
zh_hans: 模型名称不能为空

# 模型定价
source: Model pricing
zh_hans: 模型定价

# 模型服务地址无效
source: Invalid provider URL
zh_hans: 模型服务地址无效

# 模型调用
source: Model calls
zh_hans: 模型调用

# 模型调用 {:,}
source: Model calls {:,}
zh_hans: 模型调用 {:,}

# 模型：
source: Model:
zh_hans: 模型：

# 模拟数据
source: Mock data
zh_hans: 模拟数据

# 模拟模式不使用真实重置
source: Mock mode does not redeem real resets
zh_hans: 模拟模式不使用真实重置

# 模拟模式不读取账户统计
source: Mock mode does not read account statistics
zh_hans: 模拟模式不读取账户统计

# 模拟预览 · 未连接真实 Codex
source: Mock preview · Not connected to live Codex
zh_hans: 模拟预览 · 未连接真实 Codex

# 次可用
source: available
zh_hans: 次可用

# 次未归属调用
source: unassigned calls
zh_hans: 次未归属调用

# 次调用
source: calls
zh_hans: 次调用

# 正在下载
source: Downloading
zh_hans: 正在下载

# 正在下载 %s · %d%%
source: Downloading %s · %d%%
zh_hans: 正在下载 %s · %d%%

# 正在使用
source: Redeeming
zh_hans: 正在使用

# 正在准备本地用量数据
source: Preparing local usage data
zh_hans: 正在准备本地用量数据

# 正在准备模拟用量数据
source: Preparing mock usage data
zh_hans: 正在准备模拟用量数据

# 正在加载用量数据
source: Loading usage data
zh_hans: 正在加载用量数据

# 正在同步模型价格
source: Synchronizing model prices
zh_hans: 正在同步模型价格

# 正在应用上游检测设置…
source: Applying upstream detection settings…
zh_hans: 正在应用上游检测设置…

# 正在应用启动设置…
source: Applying startup settings…
zh_hans: 正在应用启动设置…

# 正在建立用量索引
source: Building the usage index
zh_hans: 正在建立用量索引

# 正在恢复当前路由…
source: Restoring the current route…
zh_hans: 正在恢复当前路由…

# 正在恢复模型服务配置…
source: Restoring provider configuration…
zh_hans: 正在恢复模型服务配置…
